Конфигурация отчетов/Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходныйКассовыйОрдер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасходыПоСтатьям</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолжностиПоПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ТекушийБалансКассы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОтчет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДневнойОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаНакладную</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РассчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/РасходныйКассовыйОрдер/Ext/ManagerModule.bsl
Функция СоздатьРасходОрдера(ДатаНакладной, Заведение, Касса, Поставщик, Сумма, Статья, Ссылка, СсылкаНакладной, РР, ДатаОтчета) Экспорт
	
	РасходОрдер = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
	РасходОрдер.Дата =  ДатаНакладной;
	РасходОрдер.Заведение = Заведение;
	РасходОрдер.Касса = Касса;
	РасходОрдер.Поставщик = Поставщик;
	РасходОрдер.Сумма = Сумма;
	РасходОрдер.Статья = Статья;
	РасходОрдер.РасчетныйСчет = РР;
	РасходОрдер.СсылкаНаНакладную = СсылкаНакладной;
	РасходОрдер.СсылкаНаОтчет = Ссылка;
	РасходОрдер.ДатаСозданияДокумента = ДатаОтчета;

	РасходОрдер.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат РасходОрдер.Ссылка;
	
КонецФункции

Функция СсылкаНаРасходОрдер(Заведение, ДатаСмены,ИндексСтраницы, ИндексСтроки) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка,
		|	РасходныйКассовыйОрдер.Дата КАК Дата,
		|	РасходныйКассовыйОрдер.Заведение КАК Заведение,
		|	РасходныйКассовыйОрдер.ИндексСтроки КАК ИндексСтроки,
		|	РасходныйКассовыйОрдер.ИндексСтраницы КАК ИндексСтраницы
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.Дата = &Дата
		|	И РасходныйКассовыйОрдер.Заведение = &Заведение
		|	И РасходныйКассовыйОрдер.ИндексСтроки = &ИндексСтроки
		|	И РасходныйКассовыйОрдер.ИндексСтраницы = &ИндексСтраницы";
	
	Запрос.УстановитьПараметр("Дата", ДатаСмены);
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("ИндексСтраницы", ИндексСтраницы);
	Запрос.УстановитьПараметр("ИндексСтроки", ИндексСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();		
		
	Возврат Выборка.Ссылка;	
	
КонецФункции

Функция ПроверкаОплатыПН(СсылкаНаНакладную) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную КАК СсылкаНаНакладную
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную = &СсылкаНаНакладную";
	
	Запрос.УстановитьПараметр("СсылкаНаНакладную", СсылкаНаНакладную);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;	
	КонецЦикла;
	
	Возврат Ложь;	
КонецФункции


Функция СсылкаНаРассчет(СсылкаНаНакладную) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную КАК СсылкаНаНакладную,
		|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.СсылкаНаНакладную = &СсылкаНаНакладную";
	
	Запрос.УстановитьПараметр("СсылкаНаНакладную", СсылкаНаНакладную);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;	
	КонецЦикла;
	
	Возврат Неопределено;
	
	
КонецФункции
